#+BABEL: :comments link :padline yes
#+TITLE: Python learning exercises using Lupapiste data

*** a) Monessako kunnassa Lupapiste-palvelua on tähän mennessä käytetty? (laske uniikit municpalityId:t käyttödatasta)
#+NAME: week1-a
#+BEGIN_SRC ipython :session :exports both :results silent
  def print_week1a_result(df):
      print('Amount of municipalites that have used the service is {}').format(df.municipalityId.unique().size)
#+END_SRC

#+NAME: print-week1-a
#+BEGIN_SRC ipython :session :exports both :results output
  print_week1a_result(df)
#+END_SRC

#+RESULTS: print-week1-a
: Amount of municipalites that have used the service is 207

*** b) Montako luvanhakijaa Lupapisteessä on tähän mennessä ollut? (applicant-roolin käyttäjät) Entä viranomaisia? (authority)
#+NAME: week1-b
#+BEGIN_SRC ipython :session :exports both :results silent
  def print_week1b_results(df):
      print("Amount of application role users is {}").format(df[df['role'] == 'applicant'].userId.unique().size)
      print("Amount of authority role users is {}").format(df[df['role'] == 'authority'].userId.unique().size)
#+END_SRC

#+NAME: print-week1-b
#+BEGIN_SRC ipython :session :exports both :results output
  print_week1b_results(df)
#+END_SRC

#+RESULTS: print-week1-b
: Amount of application role users is 30172
: Amount of authority role users is 1647

*** H1a) Hakija ja viranomainen voivat keskustella lupahakemuksesta lisäämällä kommentteja (add-comment). Kuinka monta kommenttia on kullakin hakemuksella?
#+NAME: week2-h1a
#+BEGIN_SRC ipython :session :exports both :results silent
  def print_week2h1a_results(df):
      print('Amount of comments on each application is:')
      print(df[(df['action'] == 'add-comment')].groupby('applicationId').count().userId)
#+END_SRC

#+NAME: print-week2-h1a
#+BEGIN_SRC ipython :session :exports both :results output
  print_week2h1a_results(df)
#+END_SRC

#+RESULTS: print-week2-h1a
#+begin_example
Amount of comments on each application is:
applicationId
LP-1000-200011     2
LP-1000-200086     2
LP-1000-200188     3
LP-1000-200193    10
LP-1000-200263     6
LP-1000-200271     6
LP-1000-200317     5
LP-1000-200414    31
LP-1000-200436     2
LP-1000-200452     4
LP-1000-200459     5
LP-1000-200505    12
LP-1000-200522     3
LP-1000-200546    11
LP-1000-200557    11
LP-1000-200569     2
LP-1000-200570     2
LP-1000-200582    17
LP-1000-200584     2
LP-1000-200598    18
LP-1000-200630    15
LP-1000-200655     7
LP-1000-200669     5
LP-1000-200695     8
LP-1000-200709    11
LP-1000-200742    11
LP-1000-200962     5
LP-1000-200975     2
LP-1000-200977    11
LP-1000-200988    10
                  ..
LP-1177-237750     3
LP-1177-237952     2
LP-1177-239316     1
LP-1177-240067     2
LP-1177-247461     1
LP-1178-236402     1
LP-1181-240117     3
LP-1181-258245     7
LP-1181-258343     1
LP-1181-260200    11
LP-1183-246362     1
LP-1183-259142     2
LP-1184-246409     2
LP-1187-248542     1
LP-1187-248543     2
LP-1189-250529     2
LP-1190-251318     3
LP-1191-259064     2
LP-1192-253259     1
LP-1193-257057     1
LP-1193-257072     1
LP-1196-255826     1
LP-1198-257915     2
LP-1199-258140     2
LP-1199-261490     4
LP-1200-258208     1
LP-1200-261368     1
LP-1202-258422     1
LP-1204-262026     3
LP-1206-259939     1
Name: userId, dtype: int64
#+end_example

